[
  {
    "title": "Procedural Map Generation for Roguelike Games",
    "tag": "GameDev",
    "description": "Game prototype made with Godot Engine. Using algorithms, the game generates a new map (and rooms) every time the player starts a new game. The map consists of rooms which are connected by a door. The player can then move between rooms and fight enemies. The size and shape of every room is randomized.",
    "bullets": [
      "Implemented procedural map generation using algorithms like random walk and Voronoi diagrams.",
      "Designed and developed game mechanics including player movement, enemy AI, and combat systems using Godot and C#.",
      "Created art assets and animations for the game using Aseprite."
    ],
    "image": "/TPG.png",
    "tools": [
      {
        "name": "Godot",
        "url": "https://godotengine.org/"
      },
      {
        "name": "C#",
        "url": "https://docs.microsoft.com/en-us/dotnet/csharp/"
      }
    ],
    "links": [
      {
        "name": "Web",
        "image_code": "Itch",
        "url": "https://diegodmbot.itch.io/tpg"
      },
      {
        "name": "Code",
        "image_code": "Github",
        "url": "https://github.com/Diegodmbot/TFG-Procedural_Content_Generation_Godot"
      }
    ]
  },
  {
    "title": "PokemonInfo",
    "web": "Web",
    "description": "Web application which shows information about all Pokemons. The user can search for a Pokemon by name, the app then shows the Pokémon's name and image, on click it shows the Pokémon's number, type, and stats.",
    "bullets": [
      "Developed a responsive web application using React to display Pokémon information.",
      "Consumed the PokeAPI to fetch and display data dynamically based on user input.",
      "Implemented search functionality to allow users to find Pokémon by name.",
      "Implemented third user libraries such as infinite scroll and swiper to improve user experience."
    ],
    "image": "/PokemonInfo.png",
    "tools": [
      {
        "name": "React",
        "url": "https://reactjs.org/"
      },
      {
        "name": "CSS",
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS"
      },
      {
        "name": "HTML",
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML"
      }
    ],
    "links": [
      {
        "name": "Web",
        "image_code": "Web",
        "url": "https://pokemon-info-five.vercel.app/"
      },
      {
        "name": "Code",
        "image_code": "Github",
        "url": "https://github.com/Diegodmbot/PokemonInfo"
      }
    ]
  }
]
